app/controllers/friends_controller.rb

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "twitter", "created_at", "updated_at", "user_id") VALUES ('Jose ', 'Maria', 'josema@gmaill.com', '5538174917194', 'josema33', '2024-12-27 20:04:25.237331', '2024-12-27 20:04:25.237331', 3) RETURNING "id"
---
  def create
    # friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "last_name" = 'Fernandez', "updated_at" = '2024-12-18 02:35:32.912660' WHERE "friends"."id" = 7
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = 3 AND "friends"."id" = 8 LIMIT 1
---
  def correct_user
    @friend = current_user.friends.find_by(id: params[:id])

SELECT "friends".* FROM "friends" WHERE "friends"."id" = 8 LIMIT 1
---
    def set_friend
      @friend = Friend.find(params.expect(:id))